cfg/InformationRegisters/ПараметрыРасчетаЗарплатыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыРасчетаЗарплатыОрганизаций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоэффициентВечерних</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентНочных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьОтбрасыватьКопейки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкруглятьДо</Name>
					<Comment>Если 1, то отбрасывать копейки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаРаботы</Name>
					<Comment>До этой даты документ НачислениеЗарплаты проводится</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьПремии</Name>
					<Comment>Если ИСТИНА, то в табличной части Средней зарплаты появятся строки для расчета премии</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьГодоваяПремия</Name>
					<Comment>Если ИСТИНА, то в табличной части Средней зарплаты появятся строки для расчета премии за год</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентРасчетаОтОбратного</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаВзносов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыВзносовВФонды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеУчитыватьСовместителейДляСредних</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименятьЛьготуНДФЛБазовуюИДетскуюПоПорогуДетской</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеПрименятьЛьготуНДФЛДляАвансов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеПрименятьЛьготуНДФЛДляБудущихПериодов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользованиеРезерваОтпусков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриУплатеЕСВОкруглятьВБольшуюСторону</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименятьКоэффициентЕСВДляАвансов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/InformationRegisters/ПараметрыРасчетаЗарплатыОрганизаций/Forms/ФормаЗаписи/Ext/Form/Module.bsl
// Процедура - обработчик события "ПриОткрытии" формы
//
Процедура ПриОткрытии()

	Если Организация.Пустая() Тогда // проверить объект на то, что он еще не внесен в ИБ
		// Заполнить реквизиты значениями по умолчанию.
		Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
		КоэффициентВечерних = 0.20;
		КоэффициентНочных = 0.20;
		ОкруглятьДо = 0.01;
		ГруппаВзносов = Справочники.ГруппыВзносовВФонды.ОсновнойСостав;
	КонецЕсли;
	ВидимостьОписанияПараметраНДФЛ();
	
КонецПроцедуры // ПриОткрытии()

// Обработчик события "ПередЗаписью"
//
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Предупреждение(НСтр("ru='Заполните реквизит ""Организация""!';uk='Заповніть реквізит ""Організація""!'"));
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

Процедура ВидимостьОписанияПараметраНДФЛ()
	Если ПрименятьЛьготуНДФЛБазовуюИДетскуюПоПорогуДетской Тогда
		ЭлементыФормы.НадписьНДФЛ.Заголовок = НСтр("ru='Если флаг включен, при расчете НДФЛ базовая льгота применяется одновременно с льготами на детей при условии, что облагаемый доход не превышает порога, установленного п. 169.4.1. НКУ, рассчитанного пропорционально количеству детей';uk='Якщо прапор включений, при розрахунку ПДФО базова пільга застосовується одночасно з пільгами на дітей за умови, що оподатковуваний дохід не перевищує порогу, встановленого п. 169.4.1. ПКУ, розрахованого пропорційно кількості дітей'");
	Иначе
		ЭлементыФормы.НадписьНДФЛ.Заголовок = НСтр("ru='Если флаг не включен, при расчете НДФЛ базовая льгота применяется одновременно с льготами на детей только при условии, что облагаемый доход не превышает порога, установленного п. 169.4.1. НКУ';uk='Якщо прапор не включений, при розрахунку ПДФО базова пільга застосовується одночасно з пільгами на дітей тільки за умови, що оподатковуваний дохід не перевищує порогу, встановленого п. 169.4.1. ПКУ'");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрименятьЛьготуНДФЛБазовуюИДетскуюПоПорогуДетскойПриИзменении(Элемент)
	
	ВидимостьОписанияПараметраНДФЛ();
	
КонецПроцедуры
